## First Project
This is the first project in data science this week.

In [6]:
def capitalize(name):
    ...

def puntuate(name):
    ...

In [7]:
example_dic =  {...}
example_list = [...]


print('Hello World!')

Hello World!

In [8]:
print('Today is a Tuesday?')
print('Today is a Friday?')
print('Today is a Wednesday?')

Today is a Tuesday?
Today is a Friday?
Today is a Wednesday?

### Libraries
#### Data Visualization and Scientific Computations
- **Pandas** - used to load files into series(one dimensional) or dataframes(2 dimensional)
- **Numpy** - numerical python; helps us in performing scientific computations. 
- **Matplotlib** - flexible plotting library(histograms, pie charts, bar graphs etc...)
- **Seaborn** - complementary to matplotlib, same visuals less syntax.

#### Machine Learning
- **Scikit-learn** - for basic ML algos
- **Keras/Tensorflow** - for neural networks

In [9]:
import pandas as pd

In [10]:
data = pd.read_csv('Salary_dataset.csv')
type(data)

pandas.core.frame.DataFrame

In [11]:
""" 
head() = first five entries
tail() = last five entries
info() = columns available
"""

data.head(15)

    Unnamed: 0  YearsExperience   Salary
0            0              1.2  39344.0
1            1              1.4  46206.0
2            2              1.6  37732.0
3            3              2.1  43526.0
4            4              2.3  39892.0
5            5              3.0  56643.0
6            6              3.1  60151.0
7            7              3.3  54446.0
8            8              3.3  64446.0
9            9              3.8  57190.0
10          10              4.0  63219.0
11          11              4.1  55795.0
12          12              4.1  56958.0
13          13              4.2  57082.0
14          14              4.6  61112.0

In [12]:
data.tail(7)

    Unnamed: 0  YearsExperience    Salary
23          23              8.3  113813.0
24          24              8.8  109432.0
25          25              9.1  105583.0
26          26              9.6  116970.0
27          27              9.7  112636.0
28          28             10.4  122392.0
29          29             10.6  121873.0

In [13]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30 entries, 0 to 29
Data columns (total 3 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Unnamed: 0       30 non-null     int64
 1   YearsExperience  30 non-null     float64
 2   Salary           30 non-null     float64
dtypes: float64(2), int64(1)
memory usage: 852.0 bytes

### Working with Pandas
Datatypes:
- **Series** 
- **Dataframe**

In [ ]:
import pandas as pd
import numpy as np 
import matplotlib.pyplot as plt
import seaborn as sns

In [16]:
import pandas as pd


players = [
    'Allison Becker',
    'luke shaw',
    'Harry Maguire',
    'PaUl POgba',
    'Bruno FERNANdes',
    'DaRWin Nunes',
    'Kylian MBaPPe',
    'James Rodriguez',
    'MaRTin ODegaaRd',
    'Bukayo SAKa',
    'Bukayo SAKa',
    'HARRy Kane',
    'HARRy Kane'
]

copy_players = [
    'Allison Becker',
    'luke shaw',
    'Harry Maguire',
    'PaUl POgba',
    'Bruno FERNANdes',
    'DaRWin Nunes',
    'Kylian MBaPPe',
    'James Rodriguez',
    'MaRTin ODegaaRd',
    'Bukayo SAKa',
    'HARRy Kane'
]

In [33]:
n_players = pd.Series(players)



n_players

0      Allison Becker
1           luke shaw
2       Harry Maguire
3          PaUl POgba
4     Bruno FERNANdes
5        DaRWin Nunes
6       Kylian MBaPPe
7     James Rodriguez
8     MaRTin ODegaaRd
9         Bukayo SAKa
10        Bukayo SAKa
11         HARRy Kane
12         HARRy Kane
dtype: object

In [ ]:
type(players)

players.head()

AttributeError: 'list' object has no attribute 'head'

In [ ]:
n_players.value_counts()

Bukayo SAKa        2
HARRy Kane         2
Allison Becker     1
luke shaw          1
Harry Maguire      1
PaUl POgba         1
Bruno FERNANdes    1
DaRWin Nunes       1
Kylian MBaPPe      1
James Rodriguez    1
MaRTin ODegaaRd    1
Name: count, dtype: int64

In [ ]:
n_players.is_unique

False

In [ ]:
copy_players_series = pd.Series(copy_players)

copy_players_series.is_unique

True

In [ ]:
copy_players_series.info()

<class 'pandas.core.series.Series'>
RangeIndex: 11 entries, 0 to 10
Series name: None
Non-Null Count  Dtype
--------------  -----
11 non-null     object
dtypes: object(1)
memory usage: 220.0+ bytes

In [20]:
def title(name):
    name = name.title()
    return name

title('briAn cHacha')

'Brian Chacha'

In [36]:
# title(players)
title_players = []

for player in players:
    x = title(player)
    title_players.append(x)

title_players

['Allison Becker',
 'Luke Shaw',
 'Harry Maguire',
 'Paul Pogba',
 'Bruno Fernandes',
 'Darwin Nunes',
 'Kylian Mbappe',
 'James Rodriguez',
 'Martin Odegaard',
 'Bukayo Saka',
 'Bukayo Saka',
 'Harry Kane',
 'Harry Kane']

In [41]:
n_players = n_players.apply(title)

#.apply()
n_players

0      Allison Becker
1           Luke Shaw
2       Harry Maguire
3          Paul Pogba
4     Bruno Fernandes
5        Darwin Nunes
6       Kylian Mbappe
7     James Rodriguez
8     Martin Odegaard
9         Bukayo Saka
10        Bukayo Saka
11         Harry Kane
12         Harry Kane
dtype: object

In [39]:
n_players

0      Allison Becker
1           Luke Shaw
2       Harry Maguire
3          Paul Pogba
4     Bruno Fernandes
5        Darwin Nunes
6       Kylian Mbappe
7     James Rodriguez
8     Martin Odegaard
9         Bukayo Saka
10        Bukayo Saka
11         Harry Kane
12         Harry Kane
dtype: object

In [43]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30 entries, 0 to 29
Data columns (total 3 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Unnamed: 0       30 non-null     int64
 1   YearsExperience  30 non-null     float64
 2   Salary           30 non-null     float64
dtypes: float64(2), int64(1)
memory usage: 852.0 bytes

In [45]:
#dropping columns
df = data.drop('Unnamed: 0', axis=1)

df

    YearsExperience    Salary
0               1.2   39344.0
1               1.4   46206.0
2               1.6   37732.0
3               2.1   43526.0
4               2.3   39892.0
5               3.0   56643.0
6               3.1   60151.0
7               3.3   54446.0
8               3.3   64446.0
9               3.8   57190.0
10              4.0   63219.0
11              4.1   55795.0
12              4.1   56958.0
13              4.2   57082.0
14              4.6   61112.0
15              5.0   67939.0
16              5.2   66030.0
17              5.4   83089.0
18              6.0   81364.0
19              6.1   93941.0
20              6.9   91739.0
21              7.2   98274.0
22              8.0  101303.0
23              8.3  113813.0
24              8.8  109432.0
25              9.1  105583.0
26              9.6  116970.0
27              9.7  112636.0
28             10.4  122392.0
29             10.6  121873.0

In [49]:
columns_to_drop = ['Unnamed: 0', 'Salary']

cleaned_data = data.drop(columns_to_drop, axis=1)

cleaned_data

    YearsExperience
0               1.2
1               1.4
2               1.6
3               2.1
4               2.3
5               3.0
6               3.1
7               3.3
8               3.3
9               3.8
10              4.0
11              4.1
12              4.1
13              4.2
14              4.6
15              5.0
16              5.2
17              5.4
18              6.0
19              6.1
20              6.9
21              7.2
22              8.0
23              8.3
24              8.8
25              9.1
26              9.6
27              9.7
28             10.4
29             10.6

In [50]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30 entries, 0 to 29
Data columns (total 3 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Unnamed: 0       30 non-null     int64
 1   YearsExperience  30 non-null     float64
 2   Salary           30 non-null     float64
dtypes: float64(2), int64(1)
memory usage: 852.0 bytes

In [ ]:
copy_data = data.copy()

dict_mapper = {
    'Unnamed: 0': 'key',
    'YearsExperience': 'years',
    'Salary': 'wages'
}


# copy_data.rename(dict_mapper, inplace=True, axis=1)


copy_data = copy_data.rename(dict_mapper, axis=1)

copy_data

    key  years     wages
0     0    1.2   39344.0
1     1    1.4   46206.0
2     2    1.6   37732.0
3     3    2.1   43526.0
4     4    2.3   39892.0
5     5    3.0   56643.0
6     6    3.1   60151.0
7     7    3.3   54446.0
8     8    3.3   64446.0
9     9    3.8   57190.0
10   10    4.0   63219.0
11   11    4.1   55795.0
12   12    4.1   56958.0
13   13    4.2   57082.0
14   14    4.6   61112.0
15   15    5.0   67939.0
16   16    5.2   66030.0
17   17    5.4   83089.0
18   18    6.0   81364.0
19   19    6.1   93941.0
20   20    6.9   91739.0
21   21    7.2   98274.0
22   22    8.0  101303.0
23   23    8.3  113813.0
24   24    8.8  109432.0
25   25    9.1  105583.0
26   26    9.6  116970.0
27   27    9.7  112636.0
28   28   10.4  122392.0
29   29   10.6  121873.0